In [504]:
'''Part A: Day 1 – DataFrame Basics & Attributes

Find the number of rows and columns in the DataFrame.

Find the total number of elements in the DataFrame.

Check the number of dimensions of the DataFrame.

Get all the column names.

See how the row index is arranged.

Check the data type of each column.

View the summary of the DataFrame.

View all values as a NumPy array.

Transpose the DataFrame.

View the first 5 rows.

View the last 5 rows.

View summary statistics of numeric columns.

Count non-null values.

Find column-wise mean.

Find column-wise median.

Find column-wise sum.

Find column-wise minimum.

Find column-wise maximum.

Get unique values of the “age” column.

View the frequency count of the “region” column.

Find the number of unique values in each column.

Part B: Day 2 – Selection Functions
22. Select the “age” column.
23. Select both “age” and “bmi” columns together.
24. Get a specific row and column value using labels.
25. Get a specific row and column value using positions.
26. Fast single value selection using labels.
27. Fast single value selection using positions.
28. Get the first 10 rows and first 3 columns.
29. Randomly select 7 rows.
30. Get rows where “age” > 30.
31. Get rows where bmi > 25 and smoker = 'yes'.
32. View the first 10 rows and last 5 rows.

Part C: Day 2 – Modification Functions
33. Add a new column.
34. Rename a column.
35. Drop a column.
36. Update a specific row-column value.
37. Insert a new column at a specific position.
38. Copy the DataFrame and replace values in the copy.
39. Change the data type of a column.
40. Set a column as the index and then reset it.
41. Update values in some random rows.

Part D: Day 2 – Cleaning Functions
42. Check for missing values.
43. Fill missing values.
44. Drop rows with missing values.
45. Check for duplicate rows.
46. Drop duplicate rows.
47. Replace column values.
48. Clip column values within a range.
49. Check column-wise data types.

Part E: Mixed Day 1 + Day 2 Analysis
50. Check the DataFrame shape.
51. Check the total number of elements.
52. View summary statistics of numeric columns.
53. Find unique values column-wise.
54. Find max, min, mean, and median of columns.
55. View correlation of numeric columns.
56. Check the row index.
57. Check column-wise data types.
58. Try correlation without numeric columns and note observations.'''

"Part A: Day 1 – DataFrame Basics & Attributes\n\nFind the number of rows and columns in the DataFrame.\n\nFind the total number of elements in the DataFrame.\n\nCheck the number of dimensions of the DataFrame.\n\nGet all the column names.\n\nSee how the row index is arranged.\n\nCheck the data type of each column.\n\nView the summary of the DataFrame.\n\nView all values as a NumPy array.\n\nTranspose the DataFrame.\n\nView the first 5 rows.\n\nView the last 5 rows.\n\nView summary statistics of numeric columns.\n\nCount non-null values.\n\nFind column-wise mean.\n\nFind column-wise median.\n\nFind column-wise sum.\n\nFind column-wise minimum.\n\nFind column-wise maximum.\n\nGet unique values of the “age” column.\n\nView the frequency count of the “region” column.\n\nFind the number of unique values in each column.\n\nPart B: Day 2 – Selection Functions\n22. Select the “age” column.\n23. Select both “age” and “bmi” columns together.\n24. Get a specific row and column value using labels.\n25. Get a specific row and column value using positions.\n26. Fast single value selection using labels.\n27. Fast single value selection using positions.\n28. Get the first 10 rows and first 3 columns.\n29. Randomly select 7 rows.\n30. Get rows where “age” > 30.\n31. Get rows where bmi > 25 and smoker = 'yes'.\n32. View the first 10 rows and last 5 rows.\n\nPart C: Day 2 – Modification Functions\n33. Add a new column.\n34. Rename a column.\n35. Drop a column.\n36. Update a specific row-column value.\n37. Insert a new column at a specific position.\n38. Copy the DataFrame and replace values in the copy.\n39. Change the data type of a column.\n40. Set a column as the index and then reset it.\n41. Update values in some random rows.\n\nPart D: Day 2 – Cleaning Functions\n42. Check for missing values.\n43. Fill missing values.\n44. Drop rows with missing values.\n45. Check for duplicate rows.\n46. Drop duplicate rows.\n47. Replace column values.\n48. Clip column values within a range.\n49. Check column-wise data types.\n\nPart E: Mixed Day 1 + Day 2 Analysis\n50. Check the DataFrame shape.\n51. Check the total number of elements.\n52. View summary statistics of numeric columns.\n53. Find unique values column-wise.\n54. Find max, min, mean, and median of columns.\n55. View correlation of numeric columns.\n56. Check the row index.\n57. Check column-wise data types.\n58. Try correlation without numeric columns and note observations."

In [505]:
import pandas as pd

In [506]:
main_dataset = pd.read_csv("practice_dataset2.csv")
print(main_dataset)

    order_id     customer_name product_category  product_price  quantity  \
0       1001          John Doe      Electronics         299.99         1
1       1002        Jane Smith         Clothing          49.99         2
2       1003       Bob Johnson   Home & Kitchen          89.50         1
3       1004    Alice Williams            Books          19.99         3
4       1005     Michael Brown      Electronics         499.99         1
5       1006       Linda Davis             Toys          29.99         2
6       1007      James Wilson         Clothing          59.99         1
7       1008    Patricia Moore   Home & Kitchen          79.99         1
8       1009     Robert Taylor            Books          14.99         5
9       1010  Barbara Anderson      Electronics         199.99         1
10      1011         Kevin Lee             Toys          39.99         2
11      1012       Emily Clark         Clothing          69.99         1
12      1013      David Harris   Home & Kitchen          59.99         2
13      1014       Susan Lewis            Books          24.99         4
14      1015        Mark Young      Electronics         349.99         1
15      1016        Laura King             Toys          49.99         3
16      1017      Daniel Scott         Clothing          79.99         2
17      1018        Karen Hill   Home & Kitchen          99.99         1
18      1019        Paul Allen            Books          29.99         2
19      1020    Jessica Wright      Electronics         399.99         1

    order_date delivery_status
0   2023-05-10       Delivered
1   2023-05-12         Shipped
2   2023-05-13         Pending
3   2023-05-14       Delivered
4   2023-05-15       Cancelled
5   2023-05-16       Delivered
6   2023-05-17         Shipped
7   2023-05-18       Delivered
8   2023-05-19         Pending
9   2023-05-20       Delivered
10  2023-05-21         Shipped
11  2023-05-22       Delivered
12  2023-05-23         Pending
13  2023-05-24       Delivered
14  2023-05-25         Shipped
15  2023-05-26       Delivered
16  2023-05-27         Pending
17  2023-05-28       Delivered
18  2023-05-29         Shipped
19  2023-05-30       Delivered

In [507]:
main_dataset1 = main_dataset.copy()
main_dataset2 = main_dataset.copy()
main_dataset3 = main_dataset.copy()
main_dataset4 = main_dataset.copy()
main_dataset5 = main_dataset.copy()
main_dataset6 = main_dataset.copy()
main_dataset7 = main_dataset.copy()
main_dataset8 = main_dataset.copy()
main_dataset9 = main_dataset.copy()
main_dataset10 = main_dataset.copy()
main_dataset11 = main_dataset.copy()
main_dataset12 = main_dataset.copy()

In [508]:
#1.	DataFrame এর row এবং column সংখ্যা বের করো।
main_dataset.shape

(20, 7)

In [509]:
#2.	DataFrame এ মোট element সংখ্যা বের করো।
main_dataset.size

140

In [510]:
#3.	DataFrame এর dimension সংখ্যা দেখো।
main_dataset.ndim

2

In [511]:
#4.	সব column এর নাম বের করো।
print(list(main_dataset.columns))

['order_id', 'customer_name', 'product_category', 'product_price', 'quantity', 'order_date', 'delivery_status']

In [512]:
#5.	Row index কেমন সাজানো আছে দেখো।
main_dataset.index

RangeIndex(start=0, stop=20, step=1)

In [513]:
#6.	Column-wise data type দেখো।
main_dataset.dtypes

order_id              int64
customer_name        object
product_category     object
product_price       float64
quantity              int64
order_date           object
delivery_status      object
dtype: object

In [514]:
#7.	DataFrame summary দেখো।
main_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          20 non-null     int64
 1   customer_name     20 non-null     object
 2   product_category  20 non-null     object
 3   product_price     20 non-null     float64
 4   quantity          20 non-null     int64
 5   order_date        20 non-null     object
 6   delivery_status   20 non-null     object
dtypes: float64(1), int64(2), object(4)
memory usage: 1.2+ KB

In [515]:
#8.	সব values numpy array আকারে দেখো।
main_dataset.values

array([[1001, 'John Doe', 'Electronics', 299.99, 1, '2023-05-10',
        'Delivered'],
       [1002, 'Jane Smith', 'Clothing', 49.99, 2, '2023-05-12',
        'Shipped'],
       [1003, 'Bob Johnson', 'Home & Kitchen', 89.5, 1, '2023-05-13',
        'Pending'],
       [1004, 'Alice Williams', 'Books', 19.99, 3, '2023-05-14',
        'Delivered'],
       [1005, 'Michael Brown', 'Electronics', 499.99, 1, '2023-05-15',
        'Cancelled'],
       [1006, 'Linda Davis', 'Toys', 29.99, 2, '2023-05-16', 'Delivered'],
       [1007, 'James Wilson', 'Clothing', 59.99, 1, '2023-05-17',
        'Shipped'],
       [1008, 'Patricia Moore', 'Home & Kitchen', 79.99, 1, '2023-05-18',
        'Delivered'],
       [1009, 'Robert Taylor', 'Books', 14.99, 5, '2023-05-19',
        'Pending'],
       [1010, 'Barbara Anderson', 'Electronics', 199.99, 1, '2023-05-20',
        'Delivered'],
       [1011, 'Kevin Lee', 'Toys', 39.99, 2, '2023-05-21', 'Shipped'],
       [1012, 'Emily Clark', 'Clothing', 69.99, 1, '2023-05-22',
        'Delivered'],
       [1013, 'David Harris', 'Home & Kitchen', 59.99, 2, '2023-05-23',
        'Pending'],
       [1014, 'Susan Lewis', 'Books', 24.99, 4, '2023-05-24',
        'Delivered'],
       [1015, 'Mark Young', 'Electronics', 349.99, 1, '2023-05-25',
        'Shipped'],
       [1016, 'Laura King', 'Toys', 49.99, 3, '2023-05-26', 'Delivered'],
       [1017, 'Daniel Scott', 'Clothing', 79.99, 2, '2023-05-27',
        'Pending'],
       [1018, 'Karen Hill', 'Home & Kitchen', 99.99, 1, '2023-05-28',
        'Delivered'],
       [1019, 'Paul Allen', 'Books', 29.99, 2, '2023-05-29', 'Shipped'],
       [1020, 'Jessica Wright', 'Electronics', 399.99, 1, '2023-05-30',
        'Delivered']], dtype=object)

In [516]:
#8.	সব values numpy array আকারে দেখো।
main_dataset.to_numpy

<bound method DataFrame.to_numpy of     order_id     customer_name product_category  product_price  quantity  \
0       1001          John Doe      Electronics         299.99         1
1       1002        Jane Smith         Clothing          49.99         2
2       1003       Bob Johnson   Home & Kitchen          89.50         1
3       1004    Alice Williams            Books          19.99         3
4       1005     Michael Brown      Electronics         499.99         1
5       1006       Linda Davis             Toys          29.99         2
6       1007      James Wilson         Clothing          59.99         1
7       1008    Patricia Moore   Home & Kitchen          79.99         1
8       1009     Robert Taylor            Books          14.99         5
9       1010  Barbara Anderson      Electronics         199.99         1
10      1011         Kevin Lee             Toys          39.99         2
11      1012       Emily Clark         Clothing          69.99         1
12      1013      David Harris   Home & Kitchen          59.99         2
13      1014       Susan Lewis            Books          24.99         4
14      1015        Mark Young      Electronics         349.99         1
15      1016        Laura King             Toys          49.99         3
16      1017      Daniel Scott         Clothing          79.99         2
17      1018        Karen Hill   Home & Kitchen          99.99         1
18      1019        Paul Allen            Books          29.99         2
19      1020    Jessica Wright      Electronics         399.99         1

    order_date delivery_status
0   2023-05-10       Delivered
1   2023-05-12         Shipped
2   2023-05-13         Pending
3   2023-05-14       Delivered
4   2023-05-15       Cancelled
5   2023-05-16       Delivered
6   2023-05-17         Shipped
7   2023-05-18       Delivered
8   2023-05-19         Pending
9   2023-05-20       Delivered
10  2023-05-21         Shipped
11  2023-05-22       Delivered
12  2023-05-23         Pending
13  2023-05-24       Delivered
14  2023-05-25         Shipped
15  2023-05-26       Delivered
16  2023-05-27         Pending
17  2023-05-28       Delivered
18  2023-05-29         Shipped
19  2023-05-30       Delivered  >

In [517]:
#9.	DataFrame transpose করো।
main_dataset.T

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
order_id,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,1020
customer_name,John Doe,Jane Smith,Bob Johnson,Alice Williams,Michael Brown,Linda Davis,James Wilson,Patricia Moore,Robert Taylor,Barbara Anderson,Kevin Lee,Emily Clark,David Harris,Susan Lewis,Mark Young,Laura King,Daniel Scott,Karen Hill,Paul Allen,Jessica Wright
product_category,Electronics,Clothing,Home & Kitchen,Books,Electronics,Toys,Clothing,Home & Kitchen,Books,Electronics,Toys,Clothing,Home & Kitchen,Books,Electronics,Toys,Clothing,Home & Kitchen,Books,Electronics
product_price,299.99,49.99,89.5,19.99,499.99,29.99,59.99,79.99,14.99,199.99,39.99,69.99,59.99,24.99,349.99,49.99,79.99,99.99,29.99,399.99
quantity,1,2,1,3,1,2,1,1,5,1,2,1,2,4,1,3,2,1,2,1
order_date,2023-05-10,2023-05-12,2023-05-13,2023-05-14,2023-05-15,2023-05-16,2023-05-17,2023-05-18,2023-05-19,2023-05-20,2023-05-21,2023-05-22,2023-05-23,2023-05-24,2023-05-25,2023-05-26,2023-05-27,2023-05-28,2023-05-29,2023-05-30
delivery_status,Delivered,Shipped,Pending,Delivered,Cancelled,Delivered,Shipped,Delivered,Pending,Delivered,Shipped,Delivered,Pending,Delivered,Shipped,Delivered,Pending,Delivered,Shipped,Delivered

In [518]:
#10.প্রথম 5 row দেখো।
main_dataset.head()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
0,1001,John Doe,Electronics,299.99,1,2023-05-10,Delivered
1,1002,Jane Smith,Clothing,49.99,2,2023-05-12,Shipped
2,1003,Bob Johnson,Home & Kitchen,89.50,1,2023-05-13,Pending
3,1004,Alice Williams,Books,19.99,3,2023-05-14,Delivered
4,1005,Michael Brown,Electronics,499.99,1,2023-05-15,Cancelled

In [519]:
#11.শেষের 5 row দেখো।
main_dataset.tail()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
15,1016,Laura King,Toys,49.99,3,2023-05-26,Delivered
16,1017,Daniel Scott,Clothing,79.99,2,2023-05-27,Pending
17,1018,Karen Hill,Home & Kitchen,99.99,1,2023-05-28,Delivered
18,1019,Paul Allen,Books,29.99,2,2023-05-29,Shipped
19,1020,Jessica Wright,Electronics,399.99,1,2023-05-30,Delivered

In [520]:
#12.Numeric column এর summary statistics দেখো।
main_dataset.describe()

         order_id  product_price   quantity
count    20.00000      20.000000  20.000000
mean   1010.50000     127.465500   1.850000
std       5.91608     143.281464   1.136708
min    1001.00000      14.990000   1.000000
25%    1005.75000      37.490000   1.000000
50%    1010.50000      64.990000   1.500000
75%    1015.25000     124.990000   2.000000
max    1020.00000     499.990000   5.000000

In [521]:
#13.Non-null value count বের করো।
main_dataset.notnull().sum()

order_id            20
customer_name       20
product_category    20
product_price       20
quantity            20
order_date          20
delivery_status     20
dtype: int64

In [522]:
#same as 13 number
main_dataset.count()

order_id            20
customer_name       20
product_category    20
product_price       20
quantity            20
order_date          20
delivery_status     20
dtype: int64

In [523]:
#14.Column-wise mean বের করো।
new_main_dataset1 = main_dataset1.select_dtypes(include='number')
new_main_dataset1.mean()

order_id         1010.5000
product_price     127.4655
quantity            1.8500
dtype: float64

In [524]:
#15.Column-wise median বের করো।
new_main_dataset12 = main_dataset1.select_dtypes(include='number')
print(new_main_dataset12.median())

order_id         1010.50
product_price      64.99
quantity            1.50
dtype: float64

In [525]:
#16.Column-wise sum বের করো।
print(new_main_dataset12.sum())

order_id         20210.00
product_price     2549.31
quantity            37.00
dtype: float64

In [526]:
#17.Column-wise minimum বের করো।
new_main_dataset12.min()

order_id         1001.00
product_price      14.99
quantity            1.00
dtype: float64

In [527]:
#18.Column-wise maximum বের করো।
new_main_dataset12.max()

order_id         1020.00
product_price     499.99
quantity            5.00
dtype: float64

In [528]:
#19.“price” column এর unique value বের করো।
main_dataset['product_price'].unique()

array([299.99,  49.99,  89.5 ,  19.99, 499.99,  29.99,  59.99,  79.99,
        14.99, 199.99,  39.99,  69.99,  24.99, 349.99,  99.99, 399.99])

In [529]:
main_dataset['product_price'].nunique()

16

In [530]:
#20.“product_category” column এর frequency count দেখো।
main_dataset['product_category'].value_counts()

product_category
Electronics       5
Clothing          4
Home & Kitchen    4
Books             4
Toys              3
Name: count, dtype: int64

In [531]:
#21.Column-wise unique value সংখ্যা দেখো।
main_dataset.nunique()

order_id            20
customer_name       20
product_category     5
product_price       16
quantity             5
order_date          20
delivery_status      4
dtype: int64

In [532]:
#22.“customer_name” column নির্বাচন করো।
main_dataset[['customer_name']]

       customer_name
0           John Doe
1         Jane Smith
2        Bob Johnson
3     Alice Williams
4      Michael Brown
5        Linda Davis
6       James Wilson
7     Patricia Moore
8      Robert Taylor
9   Barbara Anderson
10         Kevin Lee
11       Emily Clark
12      David Harris
13       Susan Lewis
14        Mark Young
15        Laura King
16      Daniel Scott
17        Karen Hill
18        Paul Allen
19    Jessica Wright

In [533]:
#23.“customer_name” এবং “order_id” column একসাথে নির্বাচন করো।
main_dataset[['customer_name', 'order_id']]

       customer_name  order_id
0           John Doe      1001
1         Jane Smith      1002
2        Bob Johnson      1003
3     Alice Williams      1004
4      Michael Brown      1005
5        Linda Davis      1006
6       James Wilson      1007
7     Patricia Moore      1008
8      Robert Taylor      1009
9   Barbara Anderson      1010
10         Kevin Lee      1011
11       Emily Clark      1012
12      David Harris      1013
13       Susan Lewis      1014
14        Mark Young      1015
15        Laura King      1016
16      Daniel Scott      1017
17        Karen Hill      1018
18        Paul Allen      1019
19    Jessica Wright      1020

In [534]:
#24.Label ব্যবহার করে নির্দিষ্ট row এবং column এর মান বের করো।
main_dataset.loc[1:4, ['customer_name', 'product_price', 'quantity']]

    customer_name  product_price  quantity
1      Jane Smith          49.99         2
2     Bob Johnson          89.50         1
3  Alice Williams          19.99         3
4   Michael Brown         499.99         1

In [535]:
#25.Position ব্যবহার করে নির্দিষ্ট row এবং column এর মান বের করো।
main_dataset.iloc[2:5, 3:6]

   product_price  quantity  order_date
2          89.50         1  2023-05-13
3          19.99         3  2023-05-14
4         499.99         1  2023-05-15

In [536]:
#26.Fast single value selection ব্যবহার করে নির্দিষ্ট row-column এর মান বের করো।
main_dataset.at[2, 'product_price']

np.float64(89.5)

In [537]:
#27.Position-based fast single value selection ব্যবহার করো।
main_dataset.iloc[2,1]

'Bob Johnson'

In [538]:
#28.প্রথম 10 row এবং প্রথম 3 column বের করো।
main_dataset.iloc[0:10,0:3]

   order_id     customer_name product_category
0      1001          John Doe      Electronics
1      1002        Jane Smith         Clothing
2      1003       Bob Johnson   Home & Kitchen
3      1004    Alice Williams            Books
4      1005     Michael Brown      Electronics
5      1006       Linda Davis             Toys
6      1007      James Wilson         Clothing
7      1008    Patricia Moore   Home & Kitchen
8      1009     Robert Taylor            Books
9      1010  Barbara Anderson      Electronics

In [539]:
#same as 28 no
main_dataset.head(10).iloc[:, 0:3]

   order_id     customer_name product_category
0      1001          John Doe      Electronics
1      1002        Jane Smith         Clothing
2      1003       Bob Johnson   Home & Kitchen
3      1004    Alice Williams            Books
4      1005     Michael Brown      Electronics
5      1006       Linda Davis             Toys
6      1007      James Wilson         Clothing
7      1008    Patricia Moore   Home & Kitchen
8      1009     Robert Taylor            Books
9      1010  Barbara Anderson      Electronics

In [540]:
#29.Random 7 row নির্বাচন করো।
main_dataset.sample(7)
#main_dataset.sample(7, random_state=42)
#main_dataset.sample(frac= 0.2)
#main_dataset.sample(7, axis=1)

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
16,1017,Daniel Scott,Clothing,79.99,2,2023-05-27,Pending
2,1003,Bob Johnson,Home & Kitchen,89.50,1,2023-05-13,Pending
15,1016,Laura King,Toys,49.99,3,2023-05-26,Delivered
14,1015,Mark Young,Electronics,349.99,1,2023-05-25,Shipped
8,1009,Robert Taylor,Books,14.99,5,2023-05-19,Pending
7,1008,Patricia Moore,Home & Kitchen,79.99,1,2023-05-18,Delivered
17,1018,Karen Hill,Home & Kitchen,99.99,1,2023-05-28,Delivered

In [541]:
#30.“prodectm price” > 100 row বের করো।
main_dataset[main_dataset['product_price'] > 100]

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
0,1001,John Doe,Electronics,299.99,1,2023-05-10,Delivered
4,1005,Michael Brown,Electronics,499.99,1,2023-05-15,Cancelled
9,1010,Barbara Anderson,Electronics,199.99,1,2023-05-20,Delivered
14,1015,Mark Young,Electronics,349.99,1,2023-05-25,Shipped
19,1020,Jessica Wright,Electronics,399.99,1,2023-05-30,Delivered

In [542]:
#30.“prodectm price” > 300 row বের করো।
main_dataset.query('product_price > 300')

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
4,1005,Michael Brown,Electronics,499.99,1,2023-05-15,Cancelled
14,1015,Mark Young,Electronics,349.99,1,2023-05-25,Shipped
19,1020,Jessica Wright,Electronics,399.99,1,2023-05-30,Delivered

In [543]:
#31.price > 200 এবং delivery_status = 'Delivered' row বের করো।
main_dataset.query('product_price > 200 and delivery_status == "Delivered"')

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
0,1001,John Doe,Electronics,299.99,1,2023-05-10,Delivered
19,1020,Jessica Wright,Electronics,399.99,1,2023-05-30,Delivered

In [544]:
#32.প্রথম 10 row এবং শেষের 5 row দেখো।
pd.concat([main_dataset.head(10), main_dataset.tail(5)]).reset_index(drop=True)

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status
0,1001,John Doe,Electronics,299.99,1,2023-05-10,Delivered
1,1002,Jane Smith,Clothing,49.99,2,2023-05-12,Shipped
2,1003,Bob Johnson,Home & Kitchen,89.50,1,2023-05-13,Pending
3,1004,Alice Williams,Books,19.99,3,2023-05-14,Delivered
4,1005,Michael Brown,Electronics,499.99,1,2023-05-15,Cancelled
5,1006,Linda Davis,Toys,29.99,2,2023-05-16,Delivered
6,1007,James Wilson,Clothing,59.99,1,2023-05-17,Shipped
7,1008,Patricia Moore,Home & Kitchen,79.99,1,2023-05-18,Delivered
8,1009,Robert Taylor,Books,14.99,5,2023-05-19,Pending
9,1010,Barbara Anderson,Electronics,199.99,1,2023-05-20,Delivered
10,1016,Laura King,Toys,49.99,3,2023-05-26,Delivered
11,1017,Daniel Scott,Clothing,79.99,2,2023-05-27,Pending
12,1018,Karen Hill,Home & Kitchen,99.99,1,2023-05-28,Delivered
13,1019,Paul Allen,Books,29.99,2,2023-05-29,Shipped
14,1020,Jessica Wright,Electronics,399.99,1,2023-05-30,Delivered

In [545]:
#33.নতুন column যোগ করো।
main_dataset['customer_id'] = main_dataset['order_id'] / 20
main_dataset.head()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status,customer_id
0,1001,John Doe,Electronics,299.99,1,2023-05-10,Delivered,50.05
1,1002,Jane Smith,Clothing,49.99,2,2023-05-12,Shipped,50.10
2,1003,Bob Johnson,Home & Kitchen,89.50,1,2023-05-13,Pending,50.15
3,1004,Alice Williams,Books,19.99,3,2023-05-14,Delivered,50.20
4,1005,Michael Brown,Electronics,499.99,1,2023-05-15,Cancelled,50.25

In [546]:
#33.নতুন column যোগ করো।
main_dataset['product_price'] = main_dataset['product_price'].astype(int)
main_dataset = main_dataset.assign(Discount = main_dataset['product_price']*0.2)
print(main_dataset)

    order_id     customer_name product_category  product_price  quantity  \
0       1001          John Doe      Electronics            299         1
1       1002        Jane Smith         Clothing             49         2
2       1003       Bob Johnson   Home & Kitchen             89         1
3       1004    Alice Williams            Books             19         3
4       1005     Michael Brown      Electronics            499         1
5       1006       Linda Davis             Toys             29         2
6       1007      James Wilson         Clothing             59         1
7       1008    Patricia Moore   Home & Kitchen             79         1
8       1009     Robert Taylor            Books             14         5
9       1010  Barbara Anderson      Electronics            199         1
10      1011         Kevin Lee             Toys             39         2
11      1012       Emily Clark         Clothing             69         1
12      1013      David Harris   Home & Kitchen             59         2
13      1014       Susan Lewis            Books             24         4
14      1015        Mark Young      Electronics            349         1
15      1016        Laura King             Toys             49         3
16      1017      Daniel Scott         Clothing             79         2
17      1018        Karen Hill   Home & Kitchen             99         1
18      1019        Paul Allen            Books             29         2
19      1020    Jessica Wright      Electronics            399         1

    order_date delivery_status  customer_id  Discount
0   2023-05-10       Delivered        50.05      59.8
1   2023-05-12         Shipped        50.10       9.8
2   2023-05-13         Pending        50.15      17.8
3   2023-05-14       Delivered        50.20       3.8
4   2023-05-15       Cancelled        50.25      99.8
5   2023-05-16       Delivered        50.30       5.8
6   2023-05-17         Shipped        50.35      11.8
7   2023-05-18       Delivered        50.40      15.8
8   2023-05-19         Pending        50.45       2.8
9   2023-05-20       Delivered        50.50      39.8
10  2023-05-21         Shipped        50.55       7.8
11  2023-05-22       Delivered        50.60      13.8
12  2023-05-23         Pending        50.65      11.8
13  2023-05-24       Delivered        50.70       4.8
14  2023-05-25         Shipped        50.75      69.8
15  2023-05-26       Delivered        50.80       9.8
16  2023-05-27         Pending        50.85      15.8
17  2023-05-28       Delivered        50.90      19.8
18  2023-05-29         Shipped        50.95       5.8
19  2023-05-30       Delivered        51.00      79.8

In [547]:
#34.Column এর নাম পরিবর্তন করো।
main_dataset.rename(columns={'order_id': 'Order ID', 'customer_name':'Customer Name'}).head()

,Order ID,Customer Name,product_category,product_price,quantity,order_date,delivery_status,customer_id,Discount
0,1001,John Doe,Electronics,299,1,2023-05-10,Delivered,50.05,59.8
1,1002,Jane Smith,Clothing,49,2,2023-05-12,Shipped,50.10,9.8
2,1003,Bob Johnson,Home & Kitchen,89,1,2023-05-13,Pending,50.15,17.8
3,1004,Alice Williams,Books,19,3,2023-05-14,Delivered,50.20,3.8
4,1005,Michael Brown,Electronics,499,1,2023-05-15,Cancelled,50.25,99.8

In [548]:
#35.Column drop করো।
main_dataset.drop('customer_id', axis=1).head()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status,Discount
0,1001,John Doe,Electronics,299,1,2023-05-10,Delivered,59.8
1,1002,Jane Smith,Clothing,49,2,2023-05-12,Shipped,9.8
2,1003,Bob Johnson,Home & Kitchen,89,1,2023-05-13,Pending,17.8
3,1004,Alice Williams,Books,19,3,2023-05-14,Delivered,3.8
4,1005,Michael Brown,Electronics,499,1,2023-05-15,Cancelled,99.8

In [549]:
#36.নির্দিষ্ট row-column update করো।
main_dataset.at[2, 'quantity'] = 8
main_dataset.head()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status,customer_id,Discount
0,1001,John Doe,Electronics,299,1,2023-05-10,Delivered,50.05,59.8
1,1002,Jane Smith,Clothing,49,2,2023-05-12,Shipped,50.10,9.8
2,1003,Bob Johnson,Home & Kitchen,89,8,2023-05-13,Pending,50.15,17.8
3,1004,Alice Williams,Books,19,3,2023-05-14,Delivered,50.20,3.8
4,1005,Michael Brown,Electronics,499,1,2023-05-15,Cancelled,50.25,99.8

In [550]:
main_dataset.iat[2, 2] = 'Books'
main_dataset.head()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status,customer_id,Discount
0,1001,John Doe,Electronics,299,1,2023-05-10,Delivered,50.05,59.8
1,1002,Jane Smith,Clothing,49,2,2023-05-12,Shipped,50.10,9.8
2,1003,Bob Johnson,Books,89,8,2023-05-13,Pending,50.15,17.8
3,1004,Alice Williams,Books,19,3,2023-05-14,Delivered,50.20,3.8
4,1005,Michael Brown,Electronics,499,1,2023-05-15,Cancelled,50.25,99.8

In [553]:
main_dataset.loc[1:3, 'delivery_status'] = 'Pending'
main_dataset.head()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status,customer_id,Discount
0,1001,John Doe,Electronics,299,1,2023-05-10,Delivered,50.05,59.8
1,1002,Jane Smith,Clothing,49,2,2023-05-12,Pending,50.10,9.8
2,1003,Bob Johnson,Books,89,8,2023-05-13,Pending,50.15,17.8
3,1004,Alice Williams,Books,19,3,2023-05-14,Pending,50.20,3.8
4,1005,Michael Brown,Electronics,499,1,2023-05-15,Cancelled,50.25,99.8

In [556]:
main_dataset.loc[main_dataset['product_category'] == 'Electronics', 'product_price'] = 1000
main_dataset.tail()

,order_id,customer_name,product_category,product_price,quantity,order_date,delivery_status,customer_id,Discount
15,1016,Laura King,Toys,49,3,2023-05-26,Delivered,50.80,9.8
16,1017,Daniel Scott,Clothing,79,2,2023-05-27,Pending,50.85,15.8
17,1018,Karen Hill,Home & Kitchen,99,1,2023-05-28,Delivered,50.90,19.8
18,1019,Paul Allen,Books,29,2,2023-05-29,Shipped,50.95,5.8
19,1020,Jessica Wright,Electronics,1000,1,2023-05-30,Delivered,51.00,79.8